Demo_Kabeli/src/Documents/ЗаявкиНаПредъявлениеВыполненныхЭМР/ЗаявкиНаПредъявлениеВыполненныхЭМР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкиНаПредъявлениеВыполненныхЭМР</name>
  <basedOn>Document.МонтажКабельнойПродукции</basedOn>
  <registerRecords>InformationRegister.ДанныеПоЗаданиямПоПрокладкеКабелей</registerRecords>
  <registerRecords>InformationRegister.ДанныеПоЖурналамКабельнойПродукции</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЖруналКабелей</types>
    </type>
  </attributes>
  <attributes>
    <name>ИКЖ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИКЖ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОригиналИКЖ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапСтроительства</name>
    <type>
      <types>CatalogRef.ЭтапыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖурналУчетаКабельнойПродукции</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Трассировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаАннулировано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Demo_Kabeli/src/Enums/СтатусыЖруналКабелей/СтатусыЖруналКабелей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЖруналКабелей</name>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
</mdclass:Enum>

Demo_Kabeli/src/Documents/ЗаявкиНаПредъявлениеВыполненныхЭМР/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда		
		МодульУправленияДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправленияДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;	
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
			
		Если Параметры.Свойство("ЖурналУчетаКабельнойПродукции") Тогда
			Объект.ЖурналУчетаКабельнойПродукции = Параметры.ЖурналУчетаКабельнойПродукции;	
		КонецЕсли;		
		
		Если Параметры.Свойство("Подрядчик") Тогда
			Объект.Подрядчик = Параметры.Подрядчик;	
		КонецЕсли;
		
		Объект.Статус = Перечисления.СтатусыЖруналКабелей.Подготовлен;	
		
		Если Параметры.Свойство("ЭтоРабочееМесто") Тогда   
			
			Объект.Дата = ТекущаяДата();
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));	
		КонецЕсли;		
	КонецЕсли;
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;	
	КонецЕсли;
	
	ОповеститьОВыборе(Объект.Ссылка);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандыФормы
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)

	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры  

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)

	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтаФорма, Команда);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПодписатьЗаявку(Команда)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЖруналКабелей.Подписан");	     
	
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);		
	Записать(ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЖруналКабелей.Отклонен");	
	
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);		
	Записать(ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЖруналКабелей.Подготовлен");
	
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);			
	Записать(ПараметрыЗаписи);

КонецПроцедуры
#КонецОбласти

#Область СобытияПолейФормы
 &НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	Если ЭтоИзменениеЗаявки() Тогда
		Записать();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)

	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ИКЖПриИзменении(Элемент)
	
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);	
	Записать(ПараметрыЗаписи);	

КонецПроцедуры

&НаКлиенте
Процедура ДатаИКЖПриИзменении(Элемент)

	Записать();	

КонецПроцедуры

&НаКлиенте
Процедура ОригиналИКЖПриИзменении(Элемент)

	Записать();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапСтроительстваПриИзменении(Элемент)

	Если ЭтоИзменениеЗаявки() Тогда
		Записать();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПримечаниеПриИзменении(Элемент)

	Если ЭтоИзменениеЗаявки() Тогда
		Записать();	
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Функция ЭтоИзменениеЗаявки()
	
	Возврат ЗначениеЗаполнено(Объект.Ссылка);
	
КонецФункции
#КонецОбласти
